[{"Title": "NASA's Perseverance Rover Goes Through Trials by Fire, Ice, Light and Sound", "Preview": "The agency's new Mars rover is put through a series of tests in vacuum chambers, acoustic chambers and more to get ready for the Red Planet."}, {"Title": "Sensors on Mars 2020 Spacecraft Answer Long-Distance Call From Earth", "Preview": "Instruments tailored to collect data during the descent of NASA's next rover through the Red Planet's atmosphere have been checked in flight."}, {"Title": "Virginia Middle School Student Earns Honor of Naming NASA's Next Mars Rover", "Preview": "NASA chose a seventh-grader from Virginia as winner of the agency's \"Name the Rover\" essay contest. Alexander Mather's entry for \"Perseverance\" was voted tops among 28,000 entries. "}, {"Title": "NASA's Perseverance Rover Will Look at Mars Through These 'Eyes'", "Preview": "A pair of zoomable cameras will help scientists and rover drivers with high-resolution color images."}, {"Title": "NASA's InSight Flexes Its Arm While Its 'Mole' Hits Pause", "Preview": "Now that the lander's robotic arm has helped the mole get underground, it will resume science activities that have been on hold."}, {"Title": "Alabama High School Student Names NASA's Mars Helicopter", "Preview": "Vaneeza Rupani's essay was chosen as the name for the small spacecraft, which will mark NASA's first attempt at powered flight on another planet."}, {"Title": "6 Things to Know About NASA's Ingenuity Mars Helicopter", "Preview": "The first helicopter attempting to fly on another planet is a marvel of engineering. Get up to speed with these key facts about its plans."}, {"Title": "The Launch Is Approaching for NASA's Next Mars Rover, Perseverance", "Preview": "The Red Planet's surface has been visited by eight NASA spacecraft. The ninth will be the first that includes a roundtrip ticket in its flight plan. "}, {"Title": "NASA to Reveal Name of Its Next Mars Rover", "Preview": "After a months-long contest among students to name NASA's newest Mars rover, the agency will reveal the winning name — and the winning student — this Thursday. "}, {"Title": "Heat and Dust Help Launch Martian Water Into Space, Scientists Find", "Preview": "Scientists using an instrument aboard NASA’s Mars Atmosphere and Volatile EvolutioN, or MAVEN, spacecraft have discovered that water vapor near the surface of the Red Planet is lofted higher into the atmosphere than anyone expected was possible. "}, {"Title": "NASA to Hold Mars 2020 Perseverance Rover Launch Briefing", "Preview": "Learn more about the agency's next Red Planet mission during a live event on June 17."}, {"Title": "While Stargazing on Mars, NASA's Curiosity Rover Spots Earth and Venus", "Preview": "This new portrait of the Red Planet's neighbors was taken during a time when there's more dust in the air on Mars."}, {"Title": "From JPL's Mailroom to Mars and Beyond", "Preview": "Bill Allen has thrived as the mechanical systems design lead for three Mars rover missions, but he got his start as a teenager sorting letters for the NASA center."}, {"Title": "NASA to Broadcast Mars 2020 Perseverance Launch, Prelaunch Activities", "Preview": "Starting July 27, news activities will cover everything from mission engineering and science to returning samples from Mars to, of course, the launch itself."}, {"Title": "Mars 2020 Stands on Its Own Six Wheels", "Preview": "In time-lapse video, taken at JPL, captures the first time NASA's Mars 2020 rover carries its full weight on its legs and wheels."}]